app/controllers/courses_controller.rb

INSERT INTO "courses" ("name", "time", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Senior Design"], ["time", "TR"], ["created_at", "2018-11-30 06:28:27.257180"], ["updated_at", "2018-11-30 06:28:27.257180"]]
---
    def create
        @course = Course.new(course_params)
        if @course.save