app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "classification", "major", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        @student = Student.new(student_params)
        if @student.save