app/controllers/teachers_controller.rb

    def create

        @teacher = Teacher.new(teacher_params)
            if @teacher.save
---
INSERT INTO "teachers" ("first_name", "last_name", "room", "department", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)